{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"center":true}},"banner_design_Nw8xVB":{"type":"banner-design","custom_css":[],"settings":{"page_banner_bg":"shopify:\/\/shop_images\/download_9.jpg","page_image_height":310,"banner_clr":"#52a646","textcolor":"#ffffff","image_overlay_opacity":40,"horiontal_position":50,"verticle_position":50,"text_overlay":true,"full_width":true,"title":"Different Types of Methylfolate: A detailed Comparison","des":"","searchbar":false}},"new_rich_text_bmW8Jq":{"type":"new-rich-text","blocks":{"heading_73kmUr":{"type":"heading","settings":{"text_color":"#365e99","heading":"<strong>Frenzied marketing campaigns are probably most to blame for this ‘customer confusion’<\/strong>","heading_size":"h2"}},"text_XmAqV9":{"type":"text","settings":{"text":"<p>Of course, everyone wants you to ‘buy their BEST brand’, so they try talk about it in new and different terms (selling you something shiny new and A M A Z I N G ! ! !). They’re betting you won’t be able to properly compare apples to apples. The marketing magic trick is all in the label and its presentation, is it a stick, a rod, a pole, a bar, a staff, a cane or a ‘magic wand’? Who wants the first boring options when you can have latter with a shiny picture and a promise of dreams coming true?<\/p><p>Often these companies are trying to appeal to you in the unique terms they have chosen and believe will most compel you to ‘buy’. So they educate you on their special terms and hope you won’t dig deep enough to compare and discern where their offerings fall short of their competitors. Instead they are hoping they gained enough credibility by educating you on their new-fangled name and its benefits that you won’t want to legitimately compare apples to apples.<\/p>"}},"heading_r4mXCh":{"type":"heading","settings":{"text_color":"#365e99","heading":"<strong>FDA labeling regulation changes<\/strong>","heading_size":"h2"}},"text_8U6GhM":{"type":"text","settings":{"text":"<p>These changes and the various interpretations of these changes by manufacturers across the country also cause consumer confusion. Some manufacturers are early adopters. This means when a labeling change is first discussed by the FDA, they’re already implementing it (even before the change ever gets approved or sanctioned – IF it ever gets approved). <\/p><p>Other manufacturers lag way behind and wait until all of the other players in the market have already changed their labeling before they make changes that finally become “required”. And to add further confusion, some recommendations made by the FDA are vague or suggestive, so some manufacturers believe they need to implement these changes and others do not (and no one is really ‘right’ or ‘wrong’ in these cases).<\/p><p>So the reality is you could buy 3 different bottles of a methylfolate dietary supplement product, read the labels and think they all have the exact same amount of methylfolate in them. But if you had them professionally tested, you might discover all three to be showing VASTLY different amounts of the active nutrient. <\/p>"}},"heading_z6dhk9":{"type":"heading","settings":{"text_color":"#365e99","heading":"<strong>So how then do you know what’s best for your health?!<\/strong>","heading_size":"h2"}},"text_j8zJdD":{"type":"text","settings":{"text":"<p><strong>At Methyl-Life®<\/strong>, we believe that we have the best methylfolate that money can buy and we build our products with this specialized, ultra-pure nutrient. But if that’s true, then we also believe it’s part of our job to help you understand all the competing ingredients, so you can compare them correctly (as apples to apples), and then purchase what is best for your health needs<\/p><p>We’re passionate about methylfolate and proud to bring you all the information you need to make informed choices about treating your MTHFR deficiency. So, for the more science-y folks among us who like to dig deep, we’ve created this detailed resource for understanding and comparing the industry-leading methylfolate nutrients competing on the market today.<\/p>"}},"heading_9WfeH3":{"type":"heading","settings":{"text_color":"#365e99","heading":"<strong>Comparing Methylfolate Ingredients: The Basics <\/strong>","heading_size":"h2"}},"text_af4FWQ":{"type":"text","settings":{"text":"<p>The biggest things that set the different types of methylfolate apart are:<\/p><ol><li>What types of Methylfolate are are available and how can Methylfolate be taken<\/li><li>Which isomers are present in the nutrient? Is L or (6S) best? What about (6S)+(6R) or DL?<\/li><li>What kind of salt molecule is the active L or (6S) isomer bound to?<\/li><li>How many related ‘other’ compounds are polluting the nutrient’s “purity” level?<\/li><li>How stable and therefore potent and maybe more importantly, how ‘safe’ is the methylfolate type you’re taking?<\/li><li>And believe it or not, is your methylfolate a brand and\/or patented?<\/li><\/ol><p><strong>Spoiler alert … here’s the quick facts chart that shows the comparative results after a recent study.<\/strong> Don’t worry, we’ll explain through all of it in detail as we move through the article. For the full PDF brochure of the 60-day L-methylfolate comparison study results, <a href=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0264\/6369\/9018\/files\/Methyl-Life_60-day_Methylfolate_Comparison.pdf?v=1595292111\" target=\"_blank\" title=\"Comparing L-Methylfolates - a 60-day study reveals the good, the bad and the UGLY!\"><strong>Download Now<\/strong><\/a><strong>.<\/strong><\/p>"}},"liquid_NMBy88":{"type":"liquid","settings":{"custom_liquid":"<iframe style=\"color: #0a0a0a; font-size: 16px; letter-spacing: 0px; font-family: Lato, Helvetica, Arial, Lucida, sans-serif;\" height=\"600px\" width=\"100%\" src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0264\/6369\/9018\/files\/Methylfolate_Comparison_Chart.pdf?v=1592843563\"><\/iframe>"}},"heading_Gb6nHF":{"type":"heading","settings":{"text_color":"#365e99","heading":"1. What Types of Methylfolate are Available and How Can Methylfolate Vitamins be Taken?","heading_size":"h2"}},"text_DfV3dR":{"type":"text","settings":{"text":"<p>Methylfolate is available in a range of forms, and each form varies in its method of delivery and uptake. It’s important to understand which forms are best suited to your needs.<\/p><p>MTHFR gene mutations, stress, and other biological variations can limit the body’s ability to convert synthetic folic acid into the active form of folate. This can lead to the accumulation of unmetabolized folic acid (UMFA) in the body and also disrupt the transport and metabolism of natural folates.<\/p><p>Unlike folic acid, L-methylfolate can cross the blood-brain barrier and does not mask pernicious anemia.<\/p><p>The most biologically active folate supplements are those that include (6S)-5-methyltetrahydrofolate or (6S)-5-MTHF. These can be referred to as (6S)-5-methyltetrahydrofolic acid, calcium salt or L-methylfolate and (6S)-5-methyltetrahydrofolic acid, monosodium salt or L-methyltetrahydrofolate, glucosamine salt.<\/p><p>This is the pure form of the naturally-occurring predominant form of folate. This type of water-soluble B-vitamin plays a key role in central metabolic pathways, e.g., cell division and repair.<\/p><p>Any form of methylfolate that does not specify the L isomer form (or (6S) isomer form) of methylfolate (such as methylfolate or 5-MTHF) may not be 99% pure biologically active methylfolate.<\/p><p>These can be labeled as DL-5-MTHF, 5-Methylfolate, 6RS-5-MTHF, and 5-Methyltetrahydrofolate. These forms will contain more than 1% of the D or 6R isomer form of methylfolate (most probably 50% of the unnatural D form).<\/p><p>Certain compounds may have the exact same molecular formula and sequence of bonded atoms but differ three-dimensionally. These compounds are known as stereoisomers.<\/p>"}},"heading_iKUdVd":{"type":"heading","settings":{"text_color":"#365e99","heading":"There are two common forms of stereoisomers:","heading_size":"h2"}},"text_Rxyi3H":{"type":"text","settings":{"text":"<ul><li><strong>Enantiomers:<\/strong> These are mirror images of each other. They have the same physical properties but may have different biological effects (some think of this idea as comparing a right hand to a left hand)<\/li><li><strong>Diastereoisomers:<\/strong> These are not ‘mirror images’ of one another. They rarely have the same physical properties and may have different biological effects (you could think of this as comparing a right hand to a right foot)<\/li><\/ul>"}},"heading_XPD3WD":{"type":"heading","settings":{"text_color":"#365e99","heading":"Methylfolate has stereoisomers in the form of diastereoisomers.","heading_size":"h2"}},"text_EfJrkH":{"type":"text","settings":{"text":"<p>“L” or “6S” isomer is the active form of methylfolate. This is also known as:<\/p><ul><li>Levomefolate<\/li><li>L-5-MTHF<\/li><li>L-methylfolate<\/li><li>L-5-methyltetrahydrofolate<\/li><li>(6S)-5-methyltetrahydrofolate<\/li><li>(6S)-5-MTHF<\/li><\/ul>"}},"heading_L63Uea":{"type":"heading","settings":{"text_color":"#365e99","heading":"Major internationally registered brands of L-Methylfolate include:","heading_size":"h2"}},"text_eMxLBa":{"type":"text","settings":{"text":"<ul><li>Quatrefolic®<\/li><li>Metafolin®<\/li><li>Extrafolate S®<\/li><li>Magnafolate® PRO<\/li><\/ul><p><\/p><p>Quatrefolic® is the amorphous glucosamine salt of L-methylfolate with a limited stability. Studies have suggested this form has a higher bioavailability than the calcium salts of L-methylfolate. Though this is actually more about marketing - it really has to do with high solubility creating a 'flash' feeling effect in the body - which is actually less preferential than a more consistent concentration in the blood (according to most doctors). However, it requires almost twice the dose of calcium salt forms because glucosamine is heavier than calcium. The specific form of this L-methylfolate is covered by a patent.<\/p><p>Metafolin® is the calcium salt of L-methylfolate. It is the main component in the antidepressant prescription ‘medical food’ Deplin®. Metafolin® is a patented crystalline and stable form of the “L” isomer of a specific type of calcium salt. The patent on this form is about to expire or has already expired.<\/p><p>A crystalline salt form is a key requirement for a satisfactory stability in capsules or tablets, so Metafolin® is less likely to lose its potency over time.<\/p><p>Extrafolate S® is another type of calcium salt methylfolate. Extrafolate-S® is typically labeled as (6S)-5-methyltetrahydrofolate. Extrafolate-S® is an amorphous salt form which is much less stable and tends to lose potency over time whereas Metafolin® is a crystalline salt form (Type I).<\/p><p>Magnafolate® PRO is similar to Metafolin® as it is also a calcium salt form, pure (6S) isomer of methylfolate type with a crystalline structure (Type C) for superior stability. Interestingly, this L-methylfolate has a proprietary processing method which makes the final nutrient 3x more pure than the other brands. The Type C crystallinity is patent protected.<\/p><p>Both calcium and glucosamine salt based L-methylfolates are able to cross the blood-brain barrier and pass straight into the brain cells.<\/p><p>The USP limit for impurities is 2.5% for L-methylfolate - and most of the L-methylfolates contain 0.8-0.9% impurities, but Magnafolate® PRO consistently tests at 0.2-0.3% impurities, which is quite remarkable.<\/p><p>Generic forms of methylfolate supplements are generally cheaper than the patented brands, but may not be supported by scientific studies. These OTC forms of methylfolate can be made up of a combination of the 6S and 6R isomers - so watch out, pure active L-methylfolate is a 6S or L-isomer only methylfolate. Other methylfolates may only have 50% activity.<\/p>"}},"heading_3eEfja":{"type":"heading","settings":{"text_color":"#365e99","heading":"Multivitamin Methods for Increasing L-Methylfolate ","heading_size":"h2"}},"text_k9NBQw":{"type":"text","settings":{"text":"<p>It is possible to take L-methylfolate powders or L-methylfolate tablets that contain other vitamins and minerals.<br\/><br\/>A B complex with L-methylfolate, for example, can be an efficient means of boosting levels of both L-methylfolate and other important B vitamins.<br\/><br\/>However, these L-methylfolate vitamins also have their pros and cons.<\/p>"}},"heading_RBUFYp":{"type":"heading","settings":{"text_color":"#365e99","heading":"Pros of Using Multivitamins to increase L-Methylfolate Intake","heading_size":"h2"}},"text_PxDLXH":{"type":"text","settings":{"text":"<p>L-methylfolate requires adequate stores of B6, B12, magnesium, and a number of other nutrients in order to carry out certain processes. Taking these together can better facilitate L-methylfolate’s activity in the body.<br\/><br\/>Multivitamins can help reduce deficiencies of L-methylfolate along with other vitamins or minerals. For example, those with anemia can use a L-methylfolate plus active B12 and iron supplement to improve their iron levels.<br\/><br\/>L-methylfolate containing multivitamins are a convenient means of filling in ‘gaps’ in the diet (or because of the genetic makeup where one has trouble processing folate, i.e MTHFR).<\/p>"}},"heading_HGcPXk":{"type":"heading","settings":{"text_color":"#365e99","heading":"Cons of Using Multivitamins to Increase L-Methylfolate Intake","heading_size":"h2"}},"text_iKcUHB":{"type":"text","settings":{"text":"<p>Some multivitamin supplements contain inadequate forms of nutrients that aren’t easily absorbed by the body. This means you are unlikely to benefit from them.<\/p><p>Folic acid is the form of folate that is most commonly included in multivitamins, B complex vitamins, or prenatal supplements. This is because natural folates are much more expensive, making folic acid a much cheaper option to use.<br\/><br\/>Unfortunately, folic acid is a synthetic molecule that can’t be used directly by the body. It must first be converted into tetrahydrofolate, which requires the dihydrofolate and methylenetetrahydrofolate reductase enzyme (DHFR and MTHFR). But because 40-60% of people have some degree of DHFR and\/or MTHFR gene mutation, this conversion doesn’t happen as it should.<\/p>"}},"heading_yAfi3h":{"type":"heading","settings":{"text_color":"#365e99","heading":"Can You Get L-Methylfolate Through Foods? Are there Any Foods that Are High in L-Methylfolate?","heading_size":"h2"}},"text_CPJGDD":{"type":"text","settings":{"text":"<p>L-Folates are the transporter of the smallest building blocks in the body and are vital to your health no matter your age or stage of life.<br\/><br\/>However, a large proportion of the population has a genetic enzyme deficiency that prevents the proper conversion of folic acid to L-methylfolate. This means that many people are vulnerable to low blood folate levels and subsequently, higher than desired homocysteine.Taking a folic acid supplement is of no benefit to someone who cannot convert folic acid properly. <\/p>"}},"heading_bpTr8V":{"type":"heading","settings":{"text_color":"#365e99","heading":"Foods with L-Methylfolate and\/or other L-Folate Forms","heading_size":"h2"}},"text_pCdcgb":{"type":"text","settings":{"text":"<p>L-Folate is naturally present in dark leafy greens, legumes, organ meats such as liver, and some fermented foods and drinks. Some foods contain a variety of folates including L-folinic acid and L-methylfolate. These L-methylfolate foods can help facilitate healthy methylation, while also providing other beneficial synergistic nutrients.<\/p><p>Studies suggest that a folate-rich diet may match the homocysteine-lowering effects of either a regular folic acid or L-methylfolate supplement<\/p><p>Fermentation has been shown to almost double the L-folate content of food, especially L-methylfolate.<\/p><p>The traditional Indian dish idli is a steam-fermented dough mixture of rice and black chickpeas. During the fermentation process, the L-folate content of idli can increase by 40-90%.<\/p><p><strong>Other foods high in L-methylfolate include:<\/strong><\/p><ul><li>Romaine lettuce (cos lettuce)<\/li><li>Sprouted legumes and grains (including buckwheat, mung beans, chickpeas)<\/li><li>Broccoli and cauliflower<\/li><li>Asparagus<\/li><li>Kale and spinach<\/li><li>Cabbage<\/li><li>Fermented foods (sauerkraut, miso, kefir)<\/li><li>Berries (strawberries and raspberries)<\/li><li>Citrus fruits (oranges and grapefruit)<\/li><\/ul>"}},"heading_BCkHYN":{"type":"heading","settings":{"text_color":"#365e99","heading":"Medical Foods","heading_size":"h2"}},"text_PT8Ekw":{"type":"text","settings":{"text":"<p>Some L-methylfolate products are now available as a medical food. These are prescribed for people who have conditions related to folate deficiency. Examples include Deplin®, Metanx®, Cerefolin®, NeevoDHA®, Enlyte® and XaQuil XR®.<\/p>"}},"heading_qwbGx3":{"type":"heading","settings":{"text_color":"#365e99","heading":"<strong>2. Which Isomers are present in your methylfolate? Is L-Methylfolate better than other types of methylfolate? What about (6S)-5-Methylfolate, is that okay?<\/strong>","heading_size":"h2"}},"text_QdU69T":{"type":"text","settings":{"text":"<p>Methylfolate can be quickly manufactured from folic acid as a material that has a 50\/50 mixture of the 6S and 6R isomers (or L and D respectively). These are chemically referred to as chiral diastereoisomers (explained above, very similar but not the same). One is usually considered the “active” ingredient in a compound and the other is often considered “inactive” or \"unnatural\". It takes extra processing steps to get rid of the inactive isomer in chemical development and manufacturing (this means more time, equipment, money, labor, and therefore cost).<\/p><p>Be sure your methylfolate is 100% 6S or L-isomer only – you do NOT want the inactive 6R isomer contaminating your methylfolate as it may block up any folate receptors needing the active compound and render them ineffectual. <\/p><p>Ask your methylfolate supplement company if they can show you a CofA (Certificate of Analysis) detailing the exact amount of the 6R or D-isomer (as tested) in their methylfolate (this should be considered an ‘impurity’ and should show up as less than 0.15%). <\/p><p>Note: I’m only aware of one L-methylfolate that actually provides a CofA which reports tests results for this measurement … hint … it’s not any of our competitors.<\/p>"}},"heading_kLEPXW":{"type":"heading","settings":{"text_color":"#365e99","heading":"<strong>3. What kind of salt molecule is the active L or (6S) isomer bound to?<\/strong>","heading_size":"h2"}},"text_7W7FUC":{"type":"text","settings":{"text":"<p>The majority of all L-methylfolates on the market are bound to one of two major salt molecules, calcium salt or glucosamine salt. There is actually a third salt type being used which is a magnesium salt, this L-methylfolate is called Deltafolate™. I am unaware of any over-the-counter products with this version of methylfolate in them, but there is a prescription product called Enlyte which targets depression. Suffice to say I am not the best source for more information about this particular version of methylfolate, it’s fairly small in the marketplace, I believe.<\/p><p>The most well-known prescription products in the US are based on a calcium salt type.  Over the counter dietary supplement products in the US are based on both the calcium salt and glucosamine salt types.<\/p><p>Why is this important? It’s worth noting in case you have a reaction to one particular type of L-methylfolate or another because of the salt type – then you can try a L-methylfolate from the other salt type category to see if you tolerate it better or have less reaction to it or just get better results from it. <\/p><p>Patented and branded calcium salt type L-methylfolates are Magnafolate® PRO, Metafolin® and the more rare, Extrafolate-S®, the only glucosamine salt type of methylfolate is Quatrefolic®<\/p>"}},"heading_KzyiPg":{"type":"heading","settings":{"text_color":"#365e99","heading":"<strong>4. How many “related other compounds” are polluting your L-methylfolate’s purity level?<\/strong>","heading_size":"h2"}},"text_bHw64i":{"type":"text","settings":{"text":"<p>Here’s a question most companies don’t talk about. Why? Because most don’t know what the ‘related compounds’ are that actually pollute the pure L-methylfolate. There are at least 12 specific ‘related compounds’ that we test for in our Magnafolate®. I’ve never seen any of these compounds measured on any other CofA (Certificate of Analysis) for any of the other competing L-methylfolates in the marketplace.<\/p><p>In the chemistry world, the reality is, if you don’t know it’s there, then you can’t test for it, and then how can you know what you don’t know? It takes A LOT of testing to get to the place where you understand your nutrient enough to know what all it degrades into as well as what ‘related compounds’ might be polluting it. Again, we are testing and providing results for 12 related other compounds that are considered ‘polluting’ compounds whereas the competition is not showing any of these on their CofAs.<\/p><p>I can also say that most CofAs have a ‘total impurities’ category that has a USP standard for L-methylfolate of “not more than 2.5%”.  I have seen that other competing patented L-methylfolates come in around 0.9% total impurities, whereas <strong>Magnafolate® PRO<\/strong> comes in at 0.2-0.3% impurities.   WOW!   And yes, you read it right, <strong>Magnafolate® PRO is 3x more pure than the other leading brands<\/strong>. A proprietary sonification process is used and preferred to the grinding process our competitors use (which you can imagine introduces more impurities simply due to the process of the ingredient touching more machinery and is exposed to oxidation).<\/p>"}},"heading_QL9txD":{"type":"heading","settings":{"text_color":"#365e99","heading":"<strong>5. How stable and therefore potent is your L-methylfolate?<\/strong>","heading_size":"h2"}},"text_WddKFe":{"type":"text","settings":{"text":"<p>Have you heard of <strong>crystalline vs. amorphous molecule types<\/strong>? Most of us don’t know the difference between the two, but in the biochemistry world, it makes a really BIG difference to stability which also translates into potency for an ingredient. <\/p><p>Crystalline salt molecules are considered extremely stable whereas amorphous salt molecules are known to be much less stable because of the higher exposure to oxygen. Check out the picture below showing a representation of the structure differences. It makes it easy to see why the crystalline molecule would be more stable than the amorphous (in the holes is oxygen - and therefore more oxidation and destabilization).<\/p>"}},"image_6DXHnc":{"type":"Image","settings":{"image":"shopify:\/\/shop_images\/2020-06-19_16h04_39_3000x3000_e5689ef7-71d5-4f8c-a0e0-88a14e48968d.webp"}},"text_V9BJkC":{"type":"text","settings":{"text":"<p>When comparing a crystalline molecule type, like <strong>Magnafolate®<\/strong> to an amorphous type, like <strong>Quatrefolic®<\/strong> the stability difference may shock you. <strong>Magnafolate®<\/strong> exposed to air loses about 1-2% potency over a year’s time due to stability degradation, but an amorphous L-methylfolate salt can lose up to 16% potency over that same year’s time due to its instability and more extreme degradation.<\/p><p>Okay, you say to yourself, so maybe it’s not that big of a deal, I could just take more of the amorphous salt L-methylfolate, right? True, you could, however, there are a couple of concerns with that logic:<\/p><ul><li>There’s a higher cost to taking “more” L-methylfolate – it’s a pretty pricey ingredient to start with<\/li><li>The shelf life of your product is a moving target (meaning, if you’ve purchased it 1.5 years out from when it was manufactured, it’s still not technically “expired” and it’s being sold to you as ‘good’, but there could be as much potency loss as 24%. And without a test, how will you know exactly how much more you would need to take?)<\/li><li>Even more concerning is the fact that when some products degrade, they can turn into harmful compounds. Compounds that are actually NOT GOOD for the body and can cause health problems. And who wants to pay to take an L-methylfolate that could potentially cause more health problems?<\/li><\/ul><p>In a recent comparison study that was done with all of the big patented players in the L-methylfolate market, we found just that, considerable and concerning degradation of the active nutrient. Our <strong>Magnafolate®<\/strong> was compared alongside the other industry-leading L-methylfolates, including the pharmaceutical version.<\/p><p><strong>A comparison of the ingredients’ purity AND stability was done by leaving all of the L-methylfolates out in the open air in a petri dish at room temperature (86⁰ F, relative humidity 75% ±5%) for 60 days<\/strong>.<\/p><p>Three main findings were discovered as they tested the L-methylfolates and analyzed results at the end of the 60 days:<\/p><ul><li>The <strong>Amorphous Glucosamine Salt L-methylfolate<\/strong> had lost 35.2% potency whereas the Magnafolate® had lost 0.55%<\/li><li>The <strong>Amorphous Glucosamine Salt L-methylfolate<\/strong>   nutrient had turned black in its dish whereas the Magnafolate® had remained its original light color<\/li><li>The <strong>Amorphous Glucosamine Salt L<\/strong>-<strong>methylfolate<\/strong>   had generated an impure compound which measured 19.9% at the end of the 60-day comparison. A compound known to affect T-Cells and weaken the immune system. This same ‘unhealthy’ compound was found in the Magnafolate® to be at only 0.27%. This compound is: <strong>4-(2-amino-10-methyl-4-oxo-6,7,8,9-tetrahydro-4a,7- cycloimino-pyrimido[4,5-b][1,4]diazepine-5(4H)-yl)benzoyl]-glutamate<\/strong><\/li><\/ul><p>It’s also worth noting that <strong>Methyl-Life™ had a third party recently test of a number of its own products that were sitting on the shelf for over 5 years (unopened). The results of that test showed the products were still fully potent when lab tested<\/strong>. We also had some of our main competitors’ bottles sent in for this same potency test as well. We wanted to determine how our products held up over time vs. their products. And of course, it was as we suspected, the results showed that <strong>none of the competitors’ products even met the Supplement Facts claims on their labels – they had lost too much potency<\/strong>. Of course, those products were made with L-methylfolate based on amorphous salts.<\/p><p>Both tests reveal the same truth – <strong>Magnafolate® and crystalline-based salt L-methylfolates are superior in stability, potency and purity.<\/strong><\/p>"}},"heading_ad8Mqr":{"type":"heading","settings":{"text_color":"#365e99","heading":"6. Lastly, is your L-methylfolate nutrient internationally patented and a brand? Does it really need to be?","heading_size":"h2"}},"text_JGf8bw":{"type":"text","settings":{"text":"<p>Well, yes and no. In my experience of the supplement world, if a company invests in a patent and a trademark, they tend to believe in their nutrient and are investing in its longevity in the marketplace. A patented and branded nutrient manufacturer will tend to be in business for the long haul. They will also have been through rigorous testing, studies and registration paperwork with the powers that be in order to show that their nutrient is one of the best in the market and that it has unique properties that they can prove.<\/p><p>Most companies that aren’t working hard to protect their nutrient don’t have anything very special or unique in their compound and likely have not invested in the testing, safety, research or efficacy of it.<\/p><p><strong>So are you saying it does need to be patented to be good?<\/strong><\/p><p>No, not necessarily. But for such a foundational ingredient to health like, L-methylfolate, why would you want to risk it? Why put your health in the hands of a rogue manufacturer or someone trying to make a quick buck with a copy-cat version that may be full of impurities, inactive compounds, instability, lower potency, etc.? Most of these companies won’t be testing for the related compounds which come from a nutrient’s degradation – or even know what related compounds they should be concerned about. I’d suggest you owe it to your health to do better, especially with what you put into your body as an “agent of healing”.<\/p><p><strong>So can you give me a run-down of the big competitors in the space right now?<\/strong><\/p><p>Sure, let’s go through the list in historical order.<\/p><p><strong>Spoiler alert … Let me start by saying that Methyl-Life®<\/strong>  <strong> is pleased to be the first company in North America to provide an <\/strong><a href=\"https:\/\/methyl-life.com\/collections\"><strong>L-methylfolate product line<\/strong><\/a><strong> using the crystalline calcium salt, Type-C ingredient, Magnafolate®. <\/strong>We started using it in our products in 2014. <\/p><p><strong>You saw above in the chart that in a head to head comparison study, Magnafolate® PRO beats all of the others in terms of purity, stability and potency on every score … <\/strong>but read on to get all of the nitty gritty details on each type and why the results show up as they do.<\/p>"}},"heading_6QGLw7":{"type":"heading","settings":{"text_color":"#365e99","heading":"Metafolin®","heading_size":"h2"}},"text_fWNJ4r":{"type":"text","settings":{"text":"<p>The first generation of the ingredient, L-methyltetrahydrofolate (or its short name: L-methylfolate) was first patented and trademarked by a company called Merck in Switzerland but headquartered in Germany, anyone ever heard of them? <strong>Metafolin® was marketed by Merck as “L-Methylfolate”<\/strong>. As we discussed previously, the “L” stands for the Left active chiral isomer which is also called the 6S isomer. <strong>Many consumers get confused thinking if their methylfolate is not labeled as “L-methylfolate”, then it’s not the ‘right form’ of methylfolate. But if your methylfolate is labeled as “(6S)-5-Methyltrahydrofolate”, it means the exact same thing biochemically as L-methylfolate does.<\/strong><\/p><p>Metafolin® was FDA notified and released in prescription “medical food” formulas in 2001. Those various prescription products target pregnancy, diabetes, dementia\/Alzheimer’s. And probably the most well-known product is used as an “adjunct for depression,” it’s often considered for treatment resistant depression.<\/p><p>Metafolin® is derived by bonding the “active nutritive ingredient,” the (6S) isomer of 5-MTHF, to a calcium salt molecule. The (6S) isomer of 5-MTHF is the actual “free L-methylfolate” nutrient that your body can directly absorb and immediately use (it’s often denoted as (6S)-5-Methylfolate). Metafolin® is said to be ~98-99% pure.<\/p><p><strong>So, what does purity mean?<\/strong> <\/p><p>This simply means the percentage of the ingredient which is made up of only the 6S or L-isomer. In this case 98-99% of the ingredient is made up of the calcium salt molecule that the (6S) isomer of 5-MTHF is bound to (meaning it has less than 1% of the 6R or D inactive isomer content in the raw ingredient). <strong>In the body, this means that when you ingest the Metafolin® ingredient, the calcium salt, water and impurities all dissolve and only about 74-77% of the total raw ingredient is the active (6S) or L-isomer that’s available for the body to absorb.<\/strong> This process is called “first pass metabolism” or “first pass absorption.”<\/p><p>The total impurities in this nutrient calculate out to about 0.9% up against the USP standard which says it should not have more than 2.5% total impurities, and it comes in well under that.<\/p><p><strong>So to sum it up … 1 mg of the ingredient Metafolin® equals approximately 0.77 mg of the active (6S)-5-MTHF (bioactive “free L-methylfolate”) that can be absorbed by the body<\/strong>. The other approximately 0.23 mg is made up of calcium, water and impurities. Also, it’s worth noting that Metafolin® calcium salt type is a crystalline Type I form, which has solid stability (or potency).<\/p><p>Merck has contracted with Nestlé Health Science–Pamlab, Inc. (now Alfasigma), which created a number of prescription products using Metafolin® which are available for patients in the USA. <\/p><p>L-methylfolate is having a huge impact on people all over the world, and the ramifications of that impact are still being discovered and uncovered. <strong>Here is where the competition enters (as with any great invention, there will be many who compete for a piece of the pie).<\/strong> For those who understand the value of L-methylfolate, they have been working to circumvent Merck’s patent.<\/p><p>Stick with me as we get a little technical for a minute or so.<\/p>"}},"heading_nMEMt6":{"type":"heading","settings":{"text_color":"#365e99","heading":"Generic \/ Racemic Mixtures","heading_size":"h2"}},"text_tVrAwC":{"type":"text","settings":{"text":"<p>One way that “generics” sometimes get made is to create a “racemic” mixture of an ingredient. “Racemic” refers to how the ingredient actually gets created from a chemical standpoint. Essentially, this results in a chiral molecule, which is a mirror image of the active isomer we want (it’s called an enantiomer). So, with an unpatented, “generic” variety of methylfolate (you could get a racemic mixture).<\/p><p>A racemic mixture is made up of half of the salt molecules dissolving as the (6S) isomer (so the active L-methylfolate) and the other half dissolving as the (6R) isomer (or the inactive D-methylfolate). The (6R)\/D is the unnatural diastereoisomer of the (6S)\/L isomer – and as we previously mentioned above, known to be the ‘inactive’ part.<\/p><p>A racemic version of methylfolate is sometimes labeled on its Certificate of Analysis (CofA) as DL-5-MTHF or DL-5-Methyltetrahydrofolate. But if your bottle of methylfolate says 5-Methyltetrahydrofolate, (or 5-MTHF) it’s not referring to whether or not you’re getting the active or a mix with the inactive compounds. You’ll want to request to see the nutrient’s CofA at that point, so you can verify – you only want the (6S) isomer variety of methylfolate, or L-methylfolate, otherwise your folate receptors will get clogged up with a non-working form of the enzyme.<\/p><p><strong>Basically, with a Racemic Mixture, what you get is a 50\/50 mixture of calcium salt, where 50% is the active (6S)\/L isomer your body needs and 50% is the inactive (6R)\/D isomer that your body doesn’t need. You still get about a 72-74% absorption factor overall (if the molecule is based on a crystalline type and not an amorphous type), but now you’re talking about half as much “active” material.<\/strong> In other words, with a racemic mixture of methylfolate, only about 36-37% of the ingredient is being absorbed by your body after the first pass absorption, or half of what gets absorbed when taking one of the pure patented L-methylfolates like Metafolin® or Magnafolate® PRO. <\/p><p><strong>This means that 1 mg of a generic\/racemic mixture ingredient equals approximately 0.37 mg of the active L-Methylfolate (bioactive “free methylfolate”) that can be absorbed by your body<\/strong>. AND you’re getting 0.63 mg of the material that’s not benefiting you at all (with a good portion of that being the inactive part that might be causing more harm than good to your system).<\/p><p>Using this racemic mixture strategy was how other companies were working around the long patent that Merck held for Metafolin®. Merck’s patent has recently expired and so hopefully this cheaper type of “racemic” methylfolate is no longer in the marketplace as rampantly as it used to be – but just be aware of it (it’s very cheap to access). Some information is published in this study about the questions and concerns regarding the effects of racemic versions.<\/p><p><a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/8527281\">Read the study &gt;&gt;<\/a><\/p><p>How one creative company tried to work around Merck’s patent. Enter Gnosis with Extrafolate-S®.<\/p>"}},"heading_bBbkzN":{"type":"heading","settings":{"text_color":"#365e99","heading":"Extrafolate-S®","heading_size":"h2"}},"text_thggxB":{"type":"text","settings":{"text":"<p>Gnosis has been Merck’s big L-methylfolate rival since the early days, they are based in Italy. Extrafolate-S® is similar to Magnafolate® PRO & Metafolin® in that it is a calcium-salt based molecule that the L isomer of 5-MTHF is bound to. It is also a highly pure ~98-99% ingredient (meaning it’s an L-isomer only nutrient). It also has a similar first pass absorption loss rate as Metafolin®, making it about 72-74% absorbable.<\/p><p><strong>1 mg of Extrafolate-S® equals approximately 0.74 mg of the active L-methylfolate (bioactive “free methylfolate”) that can be absorbed by your body<\/strong>.<\/p><p>The significant difference between the ingredients Extrafolate-S® and Magnafolate® PRO or Metafolin® is the powder type. Basically, the Extrafolate-S® L-methylfolate is built on an amorphous powder type. Metafolin® is built on a crystalline salt form (Type I) and Magnafolate® PRO is built on a crystalline salt form (Type C). Interestingly, the Type C molecule form ends up testing slightly more absorbable than the Type I molecule form, but the results are close for absorbability.<\/p><p>Back to Extrafolate-S® - this different powder type (an amorphous structure) is what makes it much less stable. What does this mean to you or me? <strong>It means that if the amorphous ingredient is manufactured 12 months before use, it can lose as much as 16%+ of its potency because of destabilization, compared to a crystalline molecule form, which will only lose 1-2% of its potency over a year’s time.<\/strong> <\/p><p>Extrafolate-S® is not very common in the marketplace any longer because Merck sued Gnosis over a patent breach (and actually lost), but in the interim, Gnosis began more heavily pushing its other patented, FDA-approved version, Quatrefolic®. <\/p>"}},"heading_yT8Baa":{"type":"heading","settings":{"text_color":"#365e99","heading":"Quatrefolic®","heading_size":"h2"}},"text_MqXkHw":{"type":"text","settings":{"text":"<p>A big difference between Quatrefolic® and the calcium salt-based L-methylfolate forms is that the maker, Gnosis, bound the (6S)\/L isomer of 5-MTHF (the “active nutritive ingredient” we care most about) to a different kind of salt molecule. Instead of using calcium salt, Gnosis used a glucosamine salt molecule. In 2010, Gnosis was officially recognized and notified by the FDA for its L-methylfolate, Quatrefolic®, which is often labeled as <em><strong>(6S)-5-Methylfolate, glucosamine salt<\/strong><\/em>.<\/p><p><strong>Like the others, Quatrefolic® is again ~98-99% pure, which just means that 98-99% of the 5-MTHF ingredient is made up of the (6S)\/L isomer tied to the glucosamine salt molecule.<\/strong><\/p><p><strong>However, when you ingest Quatrefolic®, the glucosamine salt molecule and other non-L-methylfolate parts dissolve and the first pass absorption rate is closer to 49-52%.<\/strong> This means about 50% of the raw ingredient becomes available for absorption (the “active nutritive ingredient” that your body can use).<\/p><p><strong>So in a perfect world, 1 mg of the Quatrefolic® nutrient would equal approximately 0.5 mg of the active L-methylfolate (bioactive “free methylfolate”) that can be absorbed by your body<\/strong>.<\/p><p>It’s worth noting that with this version of L-methylfolate, <strong>you’re actually getting less of the \"free methylfolate\" per mg of ingredient after the first pass absorption than you are with a calcium salt-based version<\/strong>. This means that, by weight, you would need more Quatrefolic® to get the same amount of the effective L-methylfolate that a calcium salt-based version contains (like Magnafolate® PRO or Metafolin®).<\/p><p>Total impurities in this nutrient initially calculate out to about 0.8% up against the USP standard which says it should not have more than 2.5% total impurities. This is what it tests at when first manufactured, but stay tuned … below we’ll show you some surprising results that can drastically increase this ‘impurities’ number over time.<\/p><p>It is worth noting that the Quatrefolic® brand has been proven to get absorbed into the bloodstream “faster” than the calcium salt brands like Magnafolate® PRO and Metafolin®. This is something you will see loudly marketed in products selling Quatrefolic®. Marketing will tout that Quatrefolic® is “the most bioavailable L-methylfolate”. Be aware this simply means it becomes available in the bloodstream faster for the body to absorb – not that any ‘more’ of it becomes available for absorption.<\/p><p><strong>But how important is this, really?<\/strong><\/p><p>Well, a faster absorption rate may make a difference in how one feels symptomatically when taking Quatrefolic® vs. one of the more stable calcium salt types like Metafolin® or Magnafolate® PRO. You could experience positive or negative methylation results faster. <\/p><p><strong>But I have to ask myself, if I need the L-methylfolate to do something specific in my body, like reduce homocysteine or boost serotonin, and it happens faster by a measure of minutes, does it really matter for me? <\/strong>In my experience, if I need more serotonin and taking the L-methylfolate makes it happen for me, I won’t really care if it happens faster by a particular amount of minutes, just as long as it happens within the hours of my day.<\/p><p>I will end by talking about the significant instability of this nutrient vs. the crystalline calcium salt types which hold their stability well. This is mostly due to the amorphous salt type that Quatrefolic® is built on.<\/p><p><strong>So what if it’s a little unstable, do we really care?<\/strong><\/p><p>Well yes, you should, mostly because instability means the nutrient is degrading and <strong>degradation can mean two big problems<\/strong>:<\/p><ol><li><strong>The potency you thought you were getting is disintegrating <\/strong>– because the chemical form of the ingredient is changing<\/li><li><strong>The integrity of the nutrient you thought you were getting is being compromised<\/strong> – unhealthy compounds can get generated when instability takes over<\/li><\/ol><p>In a recent comparative study where Magnafolate® PRO was tested against all of the big-industry, patented and branded L-methylfolates for purity, stability and potency. The results showed that the amorphous salt L-methylfolates, especially the glucosamine salt based L-methylfolate, lost significant potency and generated a large amount of an unhealthy compound. This was the chart we showed at the beginning of the article.<\/p><p>In the study all of the raw ingredients were set out at room temperature in the open air in a petri dish for 60 days’ time. After that time elapsed, tests were done to measure the potency and impurities of each specific nutrient.<\/p><ul><li>Surprisingly the Quatrefolic® turned brownish\/black in color whereas the calcium salt varieties kept their original white\/cream based color.<\/li><li>The Quatrefolic® generated a significant amount of a compound known to be harmful to the immune system (4a-Hydroxy-5-methyltetrahydrofolic acid) – this compound was shown to have increased by 19.9% over just 60 days.<\/li><\/ul><p><strong>Photo after 60 days exposure to room temperature air (86⁰ F, relative humidity 75% ±5%):<\/strong><\/p>"}},"image_ihdaG6":{"type":"Image","settings":{"image":"shopify:\/\/shop_images\/asd_df1d22a4-1059-4af3-9e73-b87cd9500d8e.webp"}}},"block_order":["heading_73kmUr","text_XmAqV9","heading_r4mXCh","text_8U6GhM","heading_z6dhk9","text_j8zJdD","heading_9WfeH3","text_af4FWQ","liquid_NMBy88","heading_Gb6nHF","text_DfV3dR","heading_iKUdVd","text_Rxyi3H","heading_XPD3WD","text_EfJrkH","heading_L63Uea","text_eMxLBa","heading_3eEfja","text_k9NBQw","heading_RBUFYp","text_PxDLXH","heading_HGcPXk","text_iKcUHB","heading_yAfi3h","text_CPJGDD","heading_bpTr8V","text_pCdcgb","heading_BCkHYN","text_PT8Ekw","heading_qwbGx3","text_QdU69T","heading_kLEPXW","text_7W7FUC","heading_KzyiPg","text_bHw64i","heading_QL9txD","text_WddKFe","image_6DXHnc","text_V9BJkC","heading_ad8Mqr","text_JGf8bw","heading_6QGLw7","text_fWNJ4r","heading_nMEMt6","text_tVrAwC","heading_bBbkzN","text_thggxB","heading_yT8Baa","text_MqXkHw","image_ihdaG6"],"settings":{"bg_clr":"#ffffff","content_alignment":"left","padding_top":40,"padding_bottom":0}},"new_rich_text_9k7KMz":{"type":"new-rich-text","blocks":{"text_CCWzHT":{"type":"text","settings":{"text":"<p>Based on those pictures, I know which L-methylfolate I “don’t” want to put into my body.<\/p><p>It’s worth noting that some people might encounter side effects based on one vs. the other salt type. So just be aware as you take your L-methylfolate that you may be fine with one salt type and have trouble with the other (or you may be fine with both). <\/p><p><strong>Pay attention to your body and switch to a different type if you think the salt version might be causing you problems.<\/strong><\/p><p><strong>Okay, on to a newer player in the L-methylfolate landscape, but the one that seems to have cracked the code for ultimate purity, stability, and potency with its superior nutrient.<\/strong><\/p>"}},"heading_YhGJER":{"type":"heading","settings":{"text_color":"#365e99","heading":"Magnafolate® PRO","heading_size":"h2"}},"text_wybinJ":{"type":"text","settings":{"text":"<p>The newest player on the scene of internationally patented and branded L-methylfolates is the Crystalline-C type of L-methylfolate. It comes from a company called Jinkang. Like the other patented L-methylfolates, it is a ~99% pure form of L-methylfolate (only the (6S)\/L isomer in their ingredient). It is also a calcium salt-based crystalline form (so extremely stable), very much like Metafolin®.<\/p><p>Magnafolate® PRO, actually measures out at a whopping ~78% “free methylfolate” absorption rate. <strong>This means that 1 mg of raw Magnafolate® PRO equals approximately 0.78 mg of the active L-methylfolate (bioactive “free methylfolate”) that can be absorbed by your body<\/strong>. This is slightly higher than Metafolin® - indicating its superior purity and therefore potency.<\/p><p>Magnafolate® PRO measures more potent than any other L-methylfolate on the market today. One reason is its impurities are almost non-existent. They calculate out to about 0.2-0.3% up against the same USP standard which says the nutrient should not have more than 2.5% total impurities. <strong>Magnafolate® PRO measures 3x more pure than the other patented L-methylfolates and any methylfolate it’s been compared against<\/strong>.<\/p><p>Check out the purity & impurity measurement results from the 60-day open air study that was done.<\/p>"}},"image_7DYNak":{"type":"Image","settings":{"image":"shopify:\/\/shop_images\/asd_b71711f9-6c7b-4080-b3e3-1a207c6440a0.webp"}},"image_WP39CJ":{"type":"Image","settings":{"image":"shopify:\/\/shop_images\/2020-06-19_16h04_39_15fa50c7-c1de-42c8-986c-aeb181552793.webp"}},"text_UFjbze":{"type":"text","settings":{"text":"<p>These charts show purity and impurities are a huge differentiating factor between the patented L-methylfolates, giving Magnafolate® PRO quite a lead over the competition.<\/p><p><strong>Magnafolate® PRO is the most chemically superior nutrient form of L-methylfolate available today<\/strong>. <\/p><p><strong>Don’t you want to know the nutrient you depend upon to ‘live your best life’ is the purest you can buy?<\/strong><\/p><p>I know I do! I take L-methylfolate every day of my life – I have since 2011 and I will likely need to until I die. My health depends upon it, and since I’m in this for the long haul, I want to ensure I’m taking the purest form available. That’s why <a href=\"https:\/\/methyl-life.com\/collections\">Methyl-Life® products<\/a> contain Magnafolate® PRO.<\/p><p><strong>Check out our <\/strong><a href=\"https:\/\/methyl-life.com\/pages\/methylation-protocol\"><strong>step by step methylation protocols page<\/strong><\/a><strong> to learn more about what ingredient amounts and which products to take.<\/strong><\/p>"}}},"block_order":["text_CCWzHT","heading_YhGJER","text_wybinJ","image_7DYNak","image_WP39CJ","text_UFjbze"],"settings":{"bg_clr":"#ffffff","content_alignment":"left","padding_top":0,"padding_bottom":40}}},"order":["main","banner_design_Nw8xVB","new_rich_text_bmW8Jq","new_rich_text_9k7KMz"]}